dealership_crm_api/app/controllers/prospects_controller.rb

    def set_prospect
      @prospect = Prospect.find(params[:id])
---
SELECT "prospects".* FROM "prospects" WHERE "prospects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]