dealership_crm_api/app/controllers/prospects_controller.rb

  def index
    @prospects = User.find(params[:user_id]).prospects.order("created_at DESC")
---
SELECT "prospects".* FROM "prospects" WHERE "prospects"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 5]]

  def create
    p "i ran"
    @prospect = Prospect.new(prospect_params)
    @prospect.user_id = params[:user_id]
    sprocess_id = Sprocess.where(name: prospect_params[:status]).ids
    p sprocess_id[0]
    @prospect.sprocess_id = sprocess_id[0]
    p @prospect.sprocess_id
    tasks = Task.where(sprocess_id: sprocess_id[0])

    tasks.each_with_index do |x|
      @prospect.task_type.push(x.lead_type)
      @prospect.task_completed.push(x.completed)
      @prospect.task_due_dates.push(x.due_date)
    end

    # p "{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}#{sprocess_id[0]}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}"

    if @prospect.save
---
SELECT "sprocesses"."id" FROM "sprocesses" WHERE "sprocesses"."name" = $1  [["name", "new"]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."sprocess_id" = $1  [["sprocess_id", 1]]
INSERT INTO "prospects" ("first_name", "last_name", "phone", "email", "status", "created_at", "updated_at", "user_id", "vehicle_id", "tasks") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
INSERT INTO "prospects" ("first_name", "last_name", "phone", "email", "status", "created_at", "updated_at", "user_id", "vehicle_id", "sprocess_id", "task_completed", "task_type", "task_due_dates") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

    def set_prospect
      @prospect = Prospect.find(params[:id])
---
SELECT "prospects".* FROM "prospects" WHERE "prospects"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]