dealership_crm_api/app/controllers/sprocesses_controller.rb

SELECT "sprocesses".* FROM "sprocesses"
---
  def index
    @sprocesses = Sprocess.all

SELECT "sprocesses".* FROM "sprocesses" WHERE "sprocesses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_sprocess
      @sprocess = Sprocess.find(params[:id])