dealership_crm_api/app/controllers/vehicles_controller.rb

  def index
    @vehicles = Vehicle.all
    vehicle_years = Vehicle.select(:year).distinct.order("year DESC")
---
SELECT "vehicles".* FROM "vehicles"
SELECT DISTINCT "vehicles"."year" FROM "vehicles" ORDER BY year DESC

  def get_makes
    vehicle_makes = Vehicle.select(:make).where(year: params[:year]).distinct
---
SELECT DISTINCT "vehicles"."make" FROM "vehicles" WHERE "vehicles"."year" = $1  [["year", 2019]]

  def get_models
    vehicle_models = Vehicle.select(:model, :id).where(year: params[:year], make: params[:make]).distinct
---
SELECT DISTINCT "vehicles"."model", "vehicles"."id" FROM "vehicles" WHERE "vehicles"."year" = $1 AND "vehicles"."make" = $2  [["year", 2020], ["make", "Toyota"]]